Repository: happydude/simplesamlphp-module-webauthn
Catalog: locales/*/LC_MESSAGES/webauthn.po
Languages: de, fr, lb

# {webauthn.webauthn:passwordlessCaption}
source: Passwordless Authentication
de: Passwortlose Authentifikation
fr: Authentification sans mot de passe
lb: Authentificatioun ouni Passwuert

# {webauthn.webauthn:passwordlessProse}
source: Did you register a biometric or PIN-protected WebAuthN token already? Log in now without username or password!
de: Haben Sie bereits ein biometrisches oder PIN-geschütztes FIDO2 Token registriert? Loggen Sie sich hier ohne Benutzernamen oder Passwort ein!
fr: Vous avez déjà enregistré un token WebAuthN biométrique ou protégé par un code PIN ? Connectez-vous sans nom d'utilisateur ni mot de passe !
lb: Huet dir schons eng biometresch oder PIN-protegéiert WebAuthN token enregistréiert? Loggt iech elo domat an, ouni Benotzernumm oder Passwuert!

# {webauthn.webauthn:dedicatedManagementPageHint}
source: If you need to add or delete tokens, please visit
fr: Pour ajouter ou supprimer des tokens, veuillez consulter

# {webauthn.webauthn:dedicatedManagementPageText}
source: Token Management
fr: Gestion des tokens

# {webauthn.webauthn:superchargeChoice}
source: - or -
de: - oder -
fr: - ou -

# {webauthn:webauthn:heading1}
source: Two Factor Authentication
de: Zwei-Faktor-Authentifizierung
fr: Authentification à deux facteurs
lb: Authentificatioun mat zwee Fakteuren

# {webauthn:webauthn:page_title}
source: Two factor authentication with FIDO2
de: Zwei-Faktor-Authentifizierung mit FIDO2
fr: Authentification à deux facteurs avec FIDO2
lb: Authentificatioun mat zwee Fakteueren, iwwert FIDO2

# {webauthn:webauthn:accountEnabled}
source: For your account, authentication with a FIDO2/WebAuthn token is required.
de: Für Ihr Benutzerkonto ist der Zugang nur mit einem FIDO2/WebAuthn Schlüssel möglich.
fr: Pour votre compte, une authentification avec un token FIDO2/WebAuthn est requise.
lb: Fir ären Compte ass agestallt, dass dir iech mat engem FIDO2/WebAuthn token aloggen misst.

# {webauthn:webauthn:tokenList}
source: The following tokens are associated with your account:
de: Bei Ihrem Benutzerkonto sind die folgenden Schlüssel registriert:
fr: Les tokens suivants sont associés à votre compte :
lb: Die folgend Tokens sin fir iech enregistréiert:

# {webauthn:webauthn:newTokenButton}
source: Enroll new token
de: Neuen Schlüssel registrieren
fr: Enregistrer un nouveau token
lb: Neien token enregistréiern

# {webauthn:webauthn:newTokenName}
source: Name for the new token:
de: Name für den neuen Schlüssel:
fr: Nom du nouveau token:
lb: Numm fir den neien token:

# {webauthn:webauthn:newTokenDefaultName}
source: Token registered at
de: Schlüssel vom
fr: Token enregistré à
lb: Token enregistréiert den

# {webauthn:webauthn:authTokenButton}
source: Authenticate
de: Authentifizieren
fr: Authentifier
lb: Umellen

# {webauthn:webauthn:wantsAdd}
source: After authenticating, I want to register a new token.
de: Nach der Anmeldung möchte ich einen Schlüssel hinzufügen.
fr: Après authentification, je souhaite enregistrer un nouveau token.
lb: No dem Umellen well ech gären eng neien Token bäipraffen.

# {webauthn:webauthn:wantsModification}
source: After authenticating, I want to register a new token or delete an existing one.
de: Nach der Anmeldung möchte ich Schlüssel hinzufügen oder löschen.
fr: Après authentification, je souhaite enregistrer un nouveau token ou en supprimer un.
lb: No dem Umellen well ech gären meng Tokens managen.

# {webauthn:webauthn:noChange}
source: Do not change anything.
de: Keine Änderungen durchführen.
fr: Ne rien modifier.
lb: Et ass gudd. Näischt änneren w.e.g.

# {webauthn:webauthn:removePrefix}
source: Remove
de: Löschen von
fr: Supprimer
lb: Läschen

# {webauthn:webauthn:currentToken}
source: (you authenticated with this token)
de: (mit diesem Schlüssel sind Sie angemeldet)
fr: (vous êtes authentifié-e avec ce token)
lb: (mat desem Token huet dir iech ugemellt)

# title_FIDO_CERTIFICATION_TOO_LOW
source: FIDO Token not Acceptable
fr: Token FIDO non accepté
lb: FIDO Token ass net akzeptabel

# descr_FIDO_CERTIFICATION_TOO_LOW
source: You attempted to register a FIDO token that does not match company policy. You may need to use a different token.
fr: Enregistrer sans mot de passe ?
lb: Dir huet versicht en Token ze benotzen den d'Firmenpolitik net erlaabt. Dir musst vläit en aaneren benotzen.
